In [1]:
from pandas import Series, DataFrame
import pandas as pd
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
obj = Series([4, 7, -5, 3])
obj
obj.index
obj.values

0    4
1    7
2   -5
3    3
dtype: int64

RangeIndex(start=0, stop=4, step=1)

array([ 4,  7, -5,  3])

In [3]:
obj = Series([4, 7, -5, 3], index=['d', 'b', 'c', 'a'])
obj
obj.index
obj.values

d    4
b    7
c   -5
a    3
dtype: int64

Index(['d', 'b', 'c', 'a'], dtype='object')

array([ 4,  7, -5,  3])

In [5]:
obj[obj>0]
np.exp(obj)

d    4
b    7
a    3
dtype: int64

d      54.598150
b    1096.633158
c       0.006738
a      20.085537
dtype: float64

In [28]:
sdata = {'Ohio':5000, 'Texas': 3000, 'California': 9000}
data = Series(sdata)
data
states = ['Oregon', 'Ohio', 'Texas', 'California']
data1 = Series(sdata, index=states)
data1

California    9000
Ohio          5000
Texas         3000
dtype: int64

Oregon           NaN
Ohio          5000.0
Texas         3000.0
California    9000.0
dtype: float64

In [29]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002], 'pop': [1.5, 1.6, 1.7, 2.4, 3.6]}
frame = DataFrame(data)
frame
frame = DataFrame(data, columns=['year','state','pop','debt'])
frame.columns

   pop   state  year
0  1.5    Ohio  2000
1  1.6    Ohio  2001
2  1.7    Ohio  2002
3  2.4  Nevada  2001
4  3.6  Nevada  2002

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [35]:
frame.year
frame.ix[3]
frame.debt = 300
frame
frame.debt = 400
frame

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

year       2001
state    Nevada
pop         2.4
debt        300
Name: 3, dtype: object

   year   state  pop  debt
0  2000    Ohio  1.5   300
1  2001    Ohio  1.6   300
2  2002    Ohio  1.7   300
3  2001  Nevada  2.4   300
4  2002  Nevada  3.6   300

   year   state  pop  debt
0  2000    Ohio  1.5   400
1  2001    Ohio  1.6   400
2  2002    Ohio  1.7   400
3  2001  Nevada  2.4   400
4  2002  Nevada  3.6   400

In [38]:
obj = Series(range(3), index = ['a', 'b', 'c'])
obj
index = obj.index
index
index[1] = 'd'

a    0
b    1
c    2
dtype: int64

Index(['a', 'b', 'c'], dtype='object')

TypeError: Index does not support mutable operations